---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.UnauthenticatedException
source: html/da7f04c9-c127-a051-f04a-0e10102721bf.htm
---
# UnauthenticatedException Methods

Retrieves data needed to serialize the target object.